In [6]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'group': ['a', 'a', 'a', 'b', 'b', 'b'], 'value_1': np.arange(6), 'value_2': np.random.randn(6)})
grouped = df.groupby('group')
grouped.count()

       value_1  value_2
group
a            3        3
b            3        3

In [8]:
grouped.sum()

       value_1   value_2
group
a            3  4.077427
b           12  2.124767

In [9]:
grouped.min()

       value_1   value_2
group
a            0  0.980618
b            3  0.023865

In [11]:
grouped.mean()

       value_1   value_2
group
a            1  1.359142
b            4  0.708256

In [12]:
grouped.agg(['sum', 'mean'])

      value_1        value_2
          sum mean       sum      mean
group
a           3    1  4.077427  1.359142
b          12    4  2.124767  0.708256